moosic/app/controllers/playlists_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def set_playlist
    current_user = User.find(session[:user_id])